b5463/kino-d4/firmware/p4/sdkconfig.defaults
# Guition JC4880P443C-I-W: ESP32-P4, 16 MB flash, 32 MB PSRAM.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# 80 MHz. Left unset this defaults to 20 MHz, and the panel then reports
# "can't fetch data from external memory fast enough, underrun happens"
# forever, because a DPI panel streams its framebuffer out of PSRAM
# continuously rather than on demand.
#
# The requirement is arithmetic, not taste. A frame is 576 x 976 clocks
# including blanking, so at 34 MHz that is ~60 Hz, and 480x800 at 16 bpp is
# 768 KB — about 46 MB/s sustained, forever, while the screen is on. Hex
# PSRAM moves 2 bytes per clock: 40 MB/s at 20 MHz, which is just under what
# the panel needs, and 160 MB/s at 80 MHz, which is comfortably over.
#
# Not 200 MHz: that option depends on IDF_EXPERIMENTAL_FEATURES and was
# silently dropped when set. Product firmware should not need an
# experimental flag to hold a picture on the screen, and 80 MHz already has
# three times the headroom required.
CONFIG_SPIRAM_SPEED_80M=y
# More cache for the same reason: the framebuffer is the one workload here
# with a continuous, unforgiving read rate.
CONFIG_CACHE_L2_CACHE_256KB=y

# The board's flash is a Boya part. Without this the generic driver is used,
# which works but cannot do chip-specific operations correctly - and this is
# the same flash whose block-protection bits silently swallowed three writes
# during bring-up, so it is worth the driver actually knowing what it is
# talking to.
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# Console stays on UART0 (GPIO37/38 on this board). KDP owns USB-Serial-JTAG
# exclusively so log output can never interleave into a frame mid-session.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# -O2, not IDF's default -Og. Every object in the P4 image was compiling at
# debug optimisation (1005 of 1005 in compile_commands.json), including the
# CRC loops, the JPEG staging copies and the KDP decoder that sit on the
# capture path. The product goal is speed over heat, and -Og gives up both.
# Bench a diagnostic build with
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.debug" build
# which flips this one option back. An existing build/ and sdkconfig keep the
# level they were generated with: `idf.py fullclean` (or delete sdkconfig)
# before the first build after this change.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Capture folders are named by UUID (36 chars) — needs FAT long filenames.
CONFIG_FATFS_LFN_HEAP=y

# Bench records name the image by hash. Left unset, ESP-IDF stamps the build
# clock into esp_app_desc, and the ELF SHA-256 beside it changes with it, so
# two clean builds of the same commit produce different .bin files — measured:
# 67 bytes differ, being three clock digits and the two SHA-256 fields. A hash
# written in HARDWARE_VALIDATION.md would then be impossible to trace back to
# the source that produced it, which is the one thing that record is for.
# Nothing in this firmware reads esp_app_get_description(), so the timestamp
# is not being given up to anything.
CONFIG_APP_REPRODUCIBLE_BUILD=y

# ── The radio is OFF, explicitly ────────────────────────────────────
#
# espressif/esp_hosted and espressif/esp_wifi_remote are managed dependencies
# (main/idf_component.yml) so the radio variant needs no manifest edit and CI
# cannot let it rot. Both default their own Kconfig to ENABLED, so the default
# camera firmware has to say no out loud.
#
# This is a safety control. With ESP_HOSTED on, the component installs a
# constructor that calls esp_hosted_init() before app_main() and drives
# GPIO14-19 and GPIO54 toward the C6 on every boot. The Guition carrier's
# routing is corroborated pin-for-pin against Espressif's own P4 host defaults
# but has never been measured, and GPIO54's polarity is unconfirmed. See
# firmware/C6_HARDWARE_MAP.md and firmware/p4/main/net_hosted.h.
#
# The opt-in is firmware/p4/sdkconfig.radio; C6_BRINGUP.md step 4 is the
# command.
CONFIG_ESP_HOSTED=n
CONFIG_ESP_WIFI_REMOTE_ENABLED=n

# The camera link ISR must run while the flash cache is off.
#
# A capture writes the JPEG to the SD card and the roll queue writes NVS, and
# both disable the cache on both cores. With the ISR in flash it cannot run
# during those windows, the 921600-baud RX FIFO overflows, and the bytes are
# gone - silently, because an overrun is not a CRC error. Measured as a first
# chunk arriving 8155 bytes of 8210 and the transfer dying at 0%, on a link
# reporting 452 KB with zero CRC errors.
CONFIG_UART_ISR_IN_IRAM=y
